import React from "react";
import "./Slide_4.scss";
const Slide_4 = () => {
  const data = [
    [
      ["/img/simzh.gif", "简体中文"],
      "漢藏語系-漢語族",
      "中國大陸、香港、澳門、台灣、新加坡、馬來西亞、蘇里南等國家和地區",
      "14.5億",
    ],

    [
      ["/img/eng.gif", "英語"],
      "印歐語系-日耳曼語族",
      "英國、美國、澳大利亞、巴哈馬、愛爾蘭、巴巴多斯、百慕大、圭亞那、牙買加、新西蘭、聖基茨、尼維斯、特立尼達、多巴哥、加拿大、多米尼克、聖路西亞、聖文森特、格林納丁斯、密克羅尼西亞聯邦、愛爾蘭、香港、利比里亞、南非、新加坡、馬來西亞等全球約110個國家和地區",
      "12.68億",
    ],
    [
      ["/img/trazh.gif", "繁體中文"],
      " 漢藏語系-漢語族",
      "香港、澳門、台灣、馬來西亞、中國大陸等國家和地區",
      "1億",
    ],
    [
      ["/img/hindi.gif", "印地語"],
      "印歐語系-印度-雅利安語支",
      "印度、巴基斯坦等國家和地區",
      "6.373億",
    ],
    [
      ["/img/spanish.gif", "西班牙語"],
      "印歐語系-羅曼語族",
      "西班牙、美國南部、赤道幾內亞、中南美洲，除了貝里斯、牙買加、海地、蘇利南、蓋亞那、法屬圭亞那和巴西等國家和地區",
      "5.379億",
    ],

    [
      ["/img/franch.gif", "法語"],
      "印歐語系-羅曼語族",
      "法國、比利時、加拿大、瑞士等國家和地區",
      "2.766億",
    ],

    [
      ["/img/arab.gif", "阿拉伯語"],
      "亞非語系-閃米特語族",
      "阿拉伯國家聯盟、以色列、厄立特里亞、馬來西亞、尼日利亞、肯尼亞、乍得、塞內加爾、南蘇丹、埃塞俄比亞、伊朗、土耳其、馬達加斯加、坦桑尼亞、莫桑比克等國家和地區",
      "2.74億",
    ],

    [
      ["/img/russian.gif", "俄語"],
      "印歐語系-斯拉夫語族",
      "俄羅斯、白俄羅斯、哈薩克斯坦、吉爾吉斯斯坦、塔吉克斯坦、盧甘斯克人民共和國、頓涅茨克人民共和國、德涅斯特河沿岸等國家和地區",
      "2.58億",
    ],

    [
      ["/img/port.gif", "葡萄牙語"],
      "印歐語系-羅曼語族",
      "葡萄牙、巴西、莫桑比克、安哥拉、幾內亞比紹、赤道幾內亞、佛得角、聖多美和普林西比、東帝汶、烏拉圭、澳門等國家和地區",
      "2.522億",
    ],

    [
      ["/img/indoe.gif", "印尼語"],
      "南島語系-馬來－波利尼西亞語族",
      "印度尼西亞、東南亞國家聯盟等國家和地區",
      "1.99億",
    ],

    [
      ["/img/german.gif", "德語"],
      "印歐語系-日耳曼語族",
      "德國、奧地利、列支敦士登、瑞士、盧森堡、比利時等國家和地區",
      "1.316億",
    ],
    [["/img/jap.gif", "日語"], "日本－琉球語系", "日本、帕勞", "1.264億"],
    [
      ["/img/korean.gif", "韓語 (朝鮮語)"],
      "孤立語言或朝鮮語系",
      "韓國、朝鮮、中國、日本、美國等國家和地區",
      "7940萬",
    ],

    [
      ["/img/vietnam.gif", "越南語"],
      "南亞語系",
      "越南、中國大陸廣西、台灣、美國、加拿大、法國、澳大利亞、捷克等國家和地區",
      "7700萬",
    ],

    [
      ["/img/Italy.gif", "意大利語"],
      "印歐語系-羅曼語族",
      "意大利、聖馬力諾、梵蒂岡、瑞士等國家和地區",
      "6770萬",
    ],

    [["/img/thai.gif", "泰語"], "壯侗語系", "泰國、柬埔寨", "6070萬"],
    [
      ["/img/myamar.gif", "緬甸語"],
      "漢藏語系藏緬語族",
      "緬甸、孟加拉國、馬來西亞、泰國、美國等國家和地區",
      "3200萬",
    ],
  ];
  return (
    <div className="slide_4">
      <table className="table">
        <colgroup>
          <col span="1" style={{ width: "15%" }} />
          <col span="1" style={{ width: "25%" }} />
          <col span="1" style={{ width: "50%" }} />
          <col span="1" style={{ width: "10%" }} />
        </colgroup>
        <thead>
          <tr>
            <th>語言</th>
            <th>語系</th>
            <th>使用國家地區</th>
            <th>分佈人口</th>
          </tr>
        </thead>
        <tbody>
          {data.map((arr, i) => (
            <tr key={i}>
              {arr.map((item, id) =>
                id === 0 ? (
                  <td key={id}>
                    <div className="item">
                      <img src={item[0]} alt="" />
                      {item[1]}
                    </div>
                  </td>
                ) : (
                  <td key={id}>{item}</td>
                )
              )}
            </tr>
          ))}
        </tbody>
      </table>
    </div>
  );
};
export default Slide_4;
